Dlubal.RFEM5.Imperfection
Imperfection parameters.

Dlubal.RFEM5.Imperfection.No
Number

Dlubal.RFEM5.Imperfection.ID
Identifier

Dlubal.RFEM5.Imperfection.Comment
Comment

Dlubal.RFEM5.Imperfection.Tag
Tag

Dlubal.RFEM5.Imperfection.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.Imperfection.ReferenceTo
Type of reference objects

Dlubal.RFEM5.Imperfection.ObjectList
List of objects on which the imperfection is defined

Dlubal.RFEM5.Imperfection.Direction
Direction of imperfection

Dlubal.RFEM5.Imperfection.Reference
Type of reference

Dlubal.RFEM5.Imperfection.Inclination
Inclination 1/φ0, σ

Dlubal.RFEM5.Imperfection.Precamber
Precamber e0, L/e0

Dlubal.RFEM5.Imperfection.PrecamberActivity
Precamber activity criterion

Dlubal.RFEM5.Imperfection.PrecamberCriterion
Precamber activity criterion ε0 [-]